Revit 2024 API
MeshTriangle Members
The MeshTriangle type exposes the following members.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Index
The index of the vertex in the Vertices array of the mesh, for indexed access.
Vertex
A vertex of the triangle.
See Also
MeshTriangle Class
Autodesk.Revit.DB Namespace